engine/src/test/resources/simple_invoke/SimpleInvoke.wsdl

<?xml version="1.0" encoding="utf-8" ?>
<!--
 * JBoss, Home of Professional Open Source
 * Copyright 2009, Red Hat Middleware LLC, and others contributors as indicated
 * by the @authors tag. All rights reserved.
 * See the copyright.txt in the distribution for a
 * full listing of individual contributors.
 * This copyrighted material is made available to anyone wishing to use,
 * modify, copy, or redistribute it subject to the terms and conditions
 * of the GNU Lesser General Public License, v. 2.1.
 * This program is distributed in the hope that it will be useful, but WITHOUT A
 * WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A
 * PARTICULAR PURPOSE.  See the GNU Lesser General Public License for more details.
 * You should have received a copy of the GNU Lesser General Public License,
 * v.2.1 along with this distribution; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston,
 * MA  02110-1301, USA.
 -->
<wsdl:definitions 
    targetNamespace="http://www.jboss.org/bpel/examples/wsdl"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:tns="http://www.jboss.org/bpel/examples/wsdl"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    
    <wsdl:message name="GreetingTarget_Message">
        <wsdl:part name="ToWhom" type="xsd:string"/>
    </wsdl:message>
    
    <wsdl:portType name="SimpleInvoke_PortType">
        <wsdl:operation name="sayHelloTo">
            <wsdl:input message="tns:GreetingTarget_Message" name="TestIn"/>
            <wsdl:output message="tns:GreetingTarget_Message" name="TestOut"/>
        </wsdl:operation>    
    </wsdl:portType>
    
     <wsdl:binding name="SimpleInvoke_SoapBinding" type="tns:SimpleInvoke_PortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="sayHelloTo">
            <soap:operation soapAction="" style="rpc"/>
            <wsdl:input>
                <soap:body
                    namespace="http://www.jboss.org/bpel/examples/wsdl"
                    use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body
                    namespace="http://www.jboss.org/bpel/examples/wsdl" 
                    use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="SimpleInvoke_Service">
		<wsdl:port name="SimpleInvoke_Port" binding="tns:SimpleInvoke_SoapBinding">
     		<soap:address location="http://localhost:8080/Quickstart_bpel_simple_invokeWS"/>
		</wsdl:port>
    </wsdl:service>
    
   <plnk:partnerLinkType name="myClientCalling_PartnerLinkType">
       <plnk:role name="me" portType="tns:SimpleInvoke_PortType"/>
       <plnk:role name="you" portType="tns:SimpleInvoke_PortType"/>
   </plnk:partnerLinkType>
</wsdl:definitions>

