tests/org.jboss.tools.bpel.ui.bot.test/messages/Simple_Invoke/Simple_Invoke_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.jboss.org/bpel/examples/wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <wsdl:sayHelloTo>
         <ToWhom>Andrej</ToWhom>
      </wsdl:sayHelloTo>
   </soapenv:Body>
</soapenv:Envelope>